Revit 2027 API
FabricSheetType.MinorDirectionWireType Property
 The id of the FabricWireType to be used in the minor direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MinorDirectionWireType { get; set; }
Public Property MinorDirectionWireType As ElementId
	Get
	Set
public:
property ElementId^ MinorDirectionWireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MinorDirectionWireType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the ElementId minorDirectionWireType is either invalid or not a FabricWireType.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: Fabric Sheet Type is Custom
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace